{
    "personalIdentity": {
        "name": "Tomás Di Bacco",
        "roll": "Fullstack Developer",
        "contact": {
            "gmail": "Contact me",
            "or": "or",
            "copy": "Copy email",
            "success": "Copied"
        }
    },
    "aboutMe": {
        "section": "About me",
        "description": {
            "first": "Full Stack Developer, optimistic, transparent and with a lot of energy to contribute. I am currently working as a Front End developer at House of CB, where I help with the development of the brand's ecommerce.",
            "second": "I find in software development the opportunity to create products that optimize processes and improve the user experience.",
            "third": "A brief summary of my work so far."
        }
    },
    "experience": {
        "section": "Experience",
        "houseofcb": {
            "title": "House of CB",
            "subTitle": "Front End Developer, May 2024 - Present",
            "firstParagraph": {
                "link": "House of CB",
                "text": " is a leading British womenswear brand, internationally acclaimed for its designer pieces. With more than 40 stores around the world and a strong presence on social networks."
            },
            "secondParagraph": {
                "text": "In 2024, currently as a frontend developer, I worked on the ",
                "link": "website",
                "otherText": " migration to Next.js 14. This involved optimizing processes, documenting, and reorganizing the entire project structure. In addition, I set up Google Analytics for site traffic analysis and implemented multi-language, currency, and cache functionalities."
            }
        },
        "strongwood": {
            "title": "Strongwood",
            "subTitle": "Front End Developer, Apr 2023 - Sep 2023",
            "firstParagraph": {
                "link": "Strongwood",
                "text": " is a company dedicated to manufacturing and selling furniture. They wanted to build a portfolio showcasing their completed projects to enhance the credibility of the brand."
            },
            "secondParagraph": {
                "text": "I developed the ",
                "link": "website ",
                "otherText": " using Next.js, React.js, TypeScript, and Sass. I handled every aspect of the page, from design to user experience.",
                "otherOtherText": "I conducted meetings with the client throughout the development process to showcase progress and ensure that we met their expectations and functional requirements."
            }
        },
        "watts": {
            "title": "25Watts",
            "subTitle": "Front End Developer, Oct 2022 - Apr 2024",
            "firstParagraph": {
                "text": "I joined the ",
                "link": "25Watts",
                "otherText": " team where I worked on the creation of websites, portfolios, ecommerce, blogs and landing pages."
            },
            "list": [
                "WordPress developments with Elementor and WooCommerce.",
                "Next.js developments with React.js, TypeScript, Node.js and Sass. Experience consuming data from a REST API to process dynamic information on the site.",
                "Implementation of sending emails with Nodemailer. Form validations with reCaptcha v2 and v3. Map integrations with the Google Maps API.",
                "I learned the application of agile methodologies - SRUM. Management of tools such as Jira, Figma, Docker and the workflow with Git."
            ],
            "secondParagraph": {
                "text": "I learned the application of Agile methodologies - specifically Scrum. I am proficient in tools such as Jira, Figma, Docker, and Git workflow management."
            }
        }
    },
    "technologies": {
        "title": "Stack"
    },
    "education": {
        "section": "Education",
        "title": "Henry Bootcamp",
        "subTitle": "Full Stack Developer, Mar. 2022 — Aug. 2024",
        "firstParagraph": {
            "text": "With more than 700 hours of practice where I learned multiple technologies, real application in projects, development of a group project with SCRUM modality to carry out an ecommerce and an individual project consisting of a SPA."
        },
        "individualProyect": {
            "title": "Individual Project: ",
            "description": "I developed a SPA-type application, based on an external API of dogs to be able to visualize them in a dynamic pagination and manipulate them through filtering and ordering."
        },
        "grupalProyect": {
            "title": "Group Project: ",
            "description": "It is a web application that has been designed for the purchase and sale of computer products. It features Shopping Cart, Custom PC Builder, Wish List, filtering, and product pagination. It also has the implementation of a paid market, user registration and different roles for navigation."
        },
        "certificate": "Certificate"
    }
}