{
    "personalIdentity": {
        "name": "Tomás Di Bacco",
        "roll": "Desarrollador Fullstack",
        "contact": {
            "gmail": "Contactame",
            "or": "o",
            "copy": "Copiar email",
            "success": "Copiado"
        },
        "cv": "Descargar curriculum"
    },
    "aboutMe": {
        "section": "Sobre mi",
        "description": {
            "first": "Desarrollador Full Stack, optimista, transparente y con mucha energia para aportar. Actualmente me encuentro trabajando como desarrollador Front End en House of CB, donde ayudo con el desarrollo del ecommerce de la marca.",
            "second": "Encuentro en el desarrollo de software la oportunindad de crear productos que optimicen procesos y mejoren la experiencia del usuario.",
            "third": "Un breve resumen de mi trabajo hasta ahora."
        }
    },
    "experience": {
        "section": "Experiencia",
        "houseofcb": {
            "title": "House of CB",
            "subTitle": "Desarrollador Front End, may. 2024 - actualidad",
            "firstParagraph": {
                "link": "House of CB",
                "text": " es una marca británica líder en ropa de mujer, aclamada internacionalmente por sus piezas de diseñador. Con más de 40 tiendas alrededor del mundo y una fuerte presencia en redes sociales."
            },
            "secondParagraph": {
                "text": "En 2024, actualmente como desarrollador frontend, trabaje en la migración del ",
                "link": "sitio web",
                "otherText": " a Next.js 14. Esto implicó optimizar procesos, documentar y reorganizar toda la estructura del proyecto. Además, configuré Google Analytics para el análisis del tráfico del sitio e implementé funcionalidades de multidioma, moneda y caché.",
                "otherOtherText": "Además, configuré Google Analytics para el análisis del tráfico del sitio e implementé funcionalidades de multidioma, moneda y caché."
            }
        },
        "strongwood": {
            "title": "Strongwood",
            "subTitle": "Desarrollador Front End, abr. 2023 — sep. 2023",
            "firstParagraph": {
                "link": "Strongwood",
                "text": " es una empresa dedicada a la fabricación y venta de muebles. Querían construir un portfolio de sus proyectos realizados para dar más credibilidad a la marca."
            },
            "secondParagraph": {
                "text": "Desarrollé el ",
                "link": "sitio web",
                "otherText": " utilizando Next.js, React.js, TypeScript y Sass. Me encargué de cada aspecto de la página, desde el diseño hasta la experiencia de usuario.",
                "otherOtherText": "Realicé reuniones con el cliente para llevar a cabo el desarrollo y mostrar avances, asegurando cumplir con sus expectativas y funcionalidades."
            }
        },
        "watts": {
            "title": "25Watts",
            "subTitle": "Desarrollador Front End, oct. 2022 — abr. 2024",
            "firstParagraph": {
                "text": "En 2022, me uní al equipo de ",
                "link": "25Watts",
                "otherText": " donde trabaje en la creación de páginas web, portfolios, ecommerce, blogs y landing pages."
            },
            "list": [
                "Desarrollos en WordPress con Elementor y WooCommerce.",
                "Desarrollos en Next.js con React.js, TypeScript, Node.js y Sass. Experiencia consumiendo datos de una API REST para procesar información dinámica en el sitio.",
                "Implementación de envío de emails con Nodemailer. Validaciones de formularios con reCaptcha v2 y v3. Integraciones de mapas con la API de Google Maps.",
                "Desarrollo de componentes bajo patrones de diseño, enfocado en la calidad y el rendimiento. Experiencia en la implementación de buenas prácticas."
            ],
            "secondParagraph": {
                "text": "Aprendí la aplicación de metodologías ágiles - SRUM. Manejo de herramientas como Jira, Figma, Docker y el flujo de trabajo con Git."
            }
        }
    },
    "technologies": {
        "title": "Tecnologías"
    },
    "education": {
        "section": "Educación",
        "title": "Henry Bootcamp",
        "subTitle": "Desarrollador Full Stack, mar. 2022 — ago. 2024",
        "firstParagraph": {
            "text": "Con más de 700 horas de práctica donde aprendí múltiples tecnologías, aplicación real en proyectos, desarrollo de un proyecto grupal con modalidad SCRUM para realizar un ecommerce y un proyecto individual consistente en un SPA."
        },
        "individualProyect": {
            "title": "Proyecto Individual: ",
            "description": "Desarrollé una aplicación de tipo SPA, basada en una API externa de perros para poder visualizarlos en un paginado dinámico y manipularlos mediante filtrados y ordenamientos."
        },
        "grupalProyect": {
            "title": "Proyecto Grupal: ",
            "description": "Es una aplicación web que ha sido pensada para la compra y venta de productos de computación. Cuenta con Carrito de compras, Custom PC Builder, Wish List, filtrados y paginado de productos. Tambien cuenta con la implementación de mercado pago, registro de usuarios y distintos roles para su navegación."
        },
        "certificate": "Certificado"
    },
    "scrollToTop": "Volver arriba"
}