{
    "personalIdentity": {
        "name": "Tomás Di Bacco",
        "roll": "Desarrollador Fullstack",
        "contact": {
            "gmail": "Contactame",
            "or": "o",
            "copy": "Copiar email",
            "success": "Copiado"
        },
        "cv": "Descargar curriculum"
    },
    "aboutMe": {
        "section": "Sobre mi",
        "description": {
            "first": "Desarrollador Full Stack con sólida experiencia en Next.js, React y tecnologías modernas del ecosistema web. Actualmente, trabajo como Full Stack en House of CB.",
            "second": "Encuentro en el desarrollo de software la oportunidad de crear productos que optimicen procesos y mejoren la experiencia del usuario.",
            "third": "Un breve resumen de mi trabajo hasta ahora."
        }
    },
    "experience": {
        "section": "Experiencia",
        "houseofcb": {
            "title": "House of CB",
            "subTitle": "Desarrollador Full Stack, may. 2024 - actualidad",
            "list": [
                "Migré el sitio web de alto tráfico a Next.js 14, logrando una estructura más escalable, eficiente y ordenada, con mejoras de rendimiento.",
                "Reorganicé el proyecto, desarrollé componentes reutilizables y propuse mejoras de performance y UX.",
                "Diseñé pantallas con React y Tailwind, colaboré con backend en PHP, maquetado de emails y tareas de staging.",
                "Participo en decisiones técnicas y en la organización del área frontend.",
                "Actualmente trabajando con React Native junto con la creación de un dashboard para gestionar la aplicación."
            ]
        },
        "strongwood": {
            "title": "Strongwood",
            "subTitle": "Desarrollador Front End, abr. 2023 — sep. 2023",
            "list":[
                "Proyecto freelance para una empresa de fabricación de muebles, desarrollado con Next.js y React.",
                "Me encargué solo del sitio web, incluyendo estructura, diseño y UX/UI, priorizando una interfaz limpia y funcional.",
                "Coordiné reuniones con el cliente para relevar requerimientos y presentar avances."
            ]
        },
        "watts": {
            "title": "25Watts",
            "subTitle": "Desarrollador Front End, oct. 2022 — abr. 2024",
            "list": [
                "Desarrollé sitios web a medida para distintos clientes (portfolios, e-commerce, blogs, landings) usando WordPress, Next.js y React.",
                "Implementé nuevas funcionalidades e integraciones con APIs y trabajé con metodologías ágiles (Scrum), aplicando buenas prácticas."
            ]
        }
    },
    "technologies": {
        "title": "Tecnologías"
    },
    "education": {
        "section": "Educación",
        "title": "Henry Bootcamp",
        "subTitle": "Desarrollador Full Stack, mar. 2022 — ago. 2024",
        "firstParagraph": {
            "text": "Más de 700 horas de aprendizaje intensivo en desarrollo Full Stack, aplicando metodologías ágiles (Scrum). Desarrollo de un proyecto individual (SPA) y uno grupal enfocado en e-commerce."
        },
        "certificate": "Certificado"
    },
    "scrollToTop": "Volver arriba"
}